'''
##################################################################
##                            修改履歷
##################################################################
==================================================================
##     日期       |      修改者      |            內容
==================================================================
##  2022/2/11    |       寶瑞       |            inital
###################################################################
'''


#導入API
import Function.API as API

#導入sys
import sys


if sys.argv[1]=='Stock_Num_Name':
    # check_code
    API.Stock_num_name( sys.argv[1])
elif sys.argv[1]=='Industry_Sector_Name':
    # check_code
    API.Industry_sector_name( sys.argv[1])